def f1 (a1,a2,a3):
  создали функцию f1 которая на вход ожидает 3 параметра (а1,
                                                          
это называется распаковка
когда не знаешь сколько ты будешь передавать аргументов, то используешь *args (может быть любое слово, но принято писать args)

                                                          
все пременные "распаковываются" в кортеж args и ты можешь к ним по индексу обращаться
args[0] например
                                                          
                                                          args = порядковые переменные
                                                          kwargs = именованные переменные (а = 500 например)
                                                          !!!!!!!!!сначала объявляются порядковые переменные затем именованные!!!!!!!!!!!!
                                                          
                                                          global это глобальные переменные как например environment in postman
                                                          
