### Задание 2.1. Напишите программу, которая проверяет здоровье персонажа в игре. Если оно равно или меньше нуля, выведите на экран False, в противном случае True.

```
num = 8
if num <= 0:
    print('You are die')
else:
    print('You are live')
```

Результат: You are live

### Задание 2.2. Напишите программу, которая проверяет является ли введенное число четным. Если да, выведите на экран текст “Четное”, а иначе - “Нечетное”

```
num = 8
if num%2:
    print('Нечетное')
else:
    print('Четное')
```

Результат: Четное

### Задание 2.3. Напишите программу, которая проверяет является ли год високосным. Таковыми считаются года, 
### которые делятся без остатка на 4 : (% 4 == 0) (2004, 2008) и не являются столетиями (500, 600): (% 100 !=0).
### Однако, если год делится без остатка  на 400: (% 400 == 0), он также считается високосным (1200, 2000)

```
year = int(input("Введите год: "))
if year % 4 == 0 and year % 100 !=0:
    print('Высокосный')
elif year % 400 == 0:
    print('Высокосный')
else:
    print('Не высокосный')
```

### Задание 2.4. Напишите программу, которая печатает введенный текст заданное количество раз, построчно.
### Текст и количество повторений нужно ввести с помощью input()

```
text = input('Введите текст: ')
n = int(input('Введите количество повторений текста: '))

for i in range(1, n):
    print(i)
```


### Задание 2.5. Напишите программу-калькулятор, которая принимает два числа и оператор (в формате str),
### производит заданное арифметическое действие и печатает результат в формате: {num1} {operator} {num2} = {result}

```
num1 = int(input('Please, enter first number: '))
num2 = int(input('Please, enter second number: '))
operator = input('Please, enter operator: ')

if operator == '+':
    result = num1 + num2
elif operator == '-':
    result = num1 - num2
elif operator == '/':
    result = num1 / num2
elif operator == '*':
    result = num1 * num2
```

else:
    print("Недопустимый оператор")
print(f"{num1} {operator} {num2} = {result}")
